In [2]:
import numpy as np
import pandas as pd

### What does df.melt do?

In [3]:
df = pd.DataFrame(
    {
        "Name": {0: "John", 1: "Bob", 2: "Shiela"},
        "Course": {0: "Masters", 1: "Graduate", 2: "Graduate"},
        "Age": {0: 27, 1: 23, 2: 21},
    }
)
example = pd.melt(df, id_vars=["Name", "Age"], value_vars=["Course"])
example

     Name  Age variable     value
0    John   27   Course   Masters
1     Bob   23   Course  Graduate
2  Shiela   21   Course  Graduate

In [4]:
df = pd.DataFrame(
    {
        "Name": ["John", "Bob", "Shiela", "John", "Bob", "Shiela"],
        "Course": [
            "Masters",
            "Graduate",
            "Graduate",
            "Masters",
            "Graduate",
            "Graduate",
        ],
        "Age": [21, 27, 31, 21, 27, 31],
        "OlderAge": [41, 47, 49, 41, 49, 51],
    }
)
df

     Name    Course  Age  OlderAge
0    John   Masters   21        41
1     Bob  Graduate   27        47
2  Shiela  Graduate   31        49
3    John   Masters   21        41
4     Bob  Graduate   27        49
5  Shiela  Graduate   31        51

### What is the purpose of melt?
- The idea is that if you have two columns that are the same, you can add them together.

In [5]:
df_melt = df.melt(
    id_vars=["Course"],
    value_vars=["Age", "OlderAge"],
    value_name="NumericalAgeValue",
    var_name="AllAges",
)
df_melt

      Course   AllAges  NumericalAgeValue
0    Masters       Age                 21
1   Graduate       Age                 27
2   Graduate       Age                 31
3    Masters       Age                 21
4   Graduate       Age                 27
5   Graduate       Age                 31
6    Masters  OlderAge                 41
7   Graduate  OlderAge                 47
8   Graduate  OlderAge                 49
9    Masters  OlderAge                 41
10  Graduate  OlderAge                 49
11  Graduate  OlderAge                 51

In [7]:
threshold = 9
z_scores = [
    [0.1, 0.5, 1.2, 0.3],  # Row 0
    [0.2, 0.4, 12.5, 0.1],  # Row 1 (Value 12.5 is > 9)
    [0.5, 0.6, 0.5, 0.2],  # Row 2
]
outlier_rows = np.where(np.max(z_scores, axis=1) > threshold)[0]
outlier_rows

array([1])